tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf18313_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16LF18313_H_
#define _PIC16LF18313_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define INTEDG                        25
#define PEIE                          26
#define GIE                           27
#define PORTA                         28
#define RA0                           29
#define RA1                           30
#define RA2                           31
#define RA3                           32
#define RA4                           33
#define RA5                           34
#define PIR0                          35
#define INTF                          36
#define IOCIF                         37
#define TMR0IF                        38
#define PIR1                          39
#define TMR1IF                        40
#define TMR2IF                        41
#define BCL1IF                        42
#define SSP1IF                        43
#define TXIF                          44
#define RCIF                          45
#define ADIF                          46
#define TMR1GIF                       47
#define PIR2                          48
#define NCO1IF                        49
#define NVMIF                         50
#define C1IF                          51
#define PIR3                          52
#define CLC1IF                        53
#define CLC2IF                        54
#define CSWIF                         55
#define OSFIF                         56
#define PIR4                          57
#define CCP1IF                        58
#define CCP2IF                        59
#define CWG1IF                        60
#define TMR00                         61
#define TMR0L                         62
#define TMR01                         63
#define TMR02                         64
#define TMR03                         65
#define TMR04                         66
#define TMR05                         67
#define TMR06                         68
#define TMR07                         69
#define TMR08                         70
#define TMR0H                         71
#define TMR09                         72
#define TMR010                        73
#define TMR011                        74
#define TMR012                        75
#define TMR013                        76
#define TMR014                        77
#define TMR015                        78
#define T0CON0                        79
#define T0OUTPS                       80
#define T0OUTPS0                      81
#define T0OUTPS1                      82
#define T0OUTPS2                      83
#define T0OUTPS3                      84
#define T016BIT                       85
#define T0OUT                         86
#define T0EN                          87
#define T0CON1                        88
#define T0CKPS                        89
#define T0CKPS0                       90
#define T0CKPS1                       91
#define T0CKPS2                       92
#define T0CKPS3                       93
#define T0ASYNC                       94
#define T0CS                          95
#define T0CS0                         96
#define T0CS1                         97
#define T0CS2                         98
#define TMR1L                         99
#define TMR1H                         100
#define T1CON                         101
#define TMR1ON                        102
#define T1SYNC                        103
#define T1SOSC                        104
#define T1CKPS0                       105
#define T1CKPS                        106
#define T1CKPS1                       107
#define TMR1CS0                       108
#define TMR1CS                        109
#define TMR1CS1                       110
#define T1GCON                        111
#define T1GSS0                        112
#define T1GSS                         113
#define T1GSS1                        114
#define T1GVAL                        115
#define T1GGO_nDONE                   116
#define T1GSPM                        117
#define T1GTM                         118
#define T1GPOL                        119
#define TMR1GE                        120
#define TMR2                          121
#define PR2                           122
#define T2CON                         123
#define T2CKPS0                       124
#define T2CKPS                        125
#define T2CKPS1                       126
#define TMR2ON                        127
#define T2OUTPS0                      128
#define T2OUTPS                       129
#define T2OUTPS1                      130
#define T2OUTPS2                      131
#define T2OUTPS3                      132
#define TRISA                         133
#define TRISA0                        134
#define TRISA1                        135
#define TRISA2                        136
#define TRISA4                        137
#define TRISA5                        138
#define PIE0                          139
#define INTE                          140
#define IOCIE                         141
#define TMR0IE                        142
#define PIE1                          143
#define TMR1IE                        144
#define TMR2IE                        145
#define BCL1IE                        146
#define SSP1IE                        147
#define TXIE                          148
#define RCIE                          149
#define ADIE                          150
#define TMR1GIE                       151
#define PIE2                          152
#define NCO1IE                        153
#define NVMIE                         154
#define C1IE                          155
#define PIE3                          156
#define CLC1IE                        157
#define CLC2IE                        158
#define CSWIE                         159
#define OSFIE                         160
#define PIE4                          161
#define CCP1IE                        162
#define CCP2IE                        163
#define CWG1IE                        164
#define WDTCON                        165
#define SWDTEN                        166
#define WDTPS                         167
#define WDTPS0                        168
#define WDTPS1                        169
#define WDTPS2                        170
#define WDTPS3                        171
#define WDTPS4                        172
#define ADRESL                        173
#define ADRESH                        174
#define ADCON0                        175
#define ADON                          176
#define GO_nDONE                      177
#define GO                            178
#define ADGO                          179
#define CHS0                          180
#define CHS                           181
#define CHS1                          182
#define CHS2                          183
#define CHS3                          184
#define CHS4                          185
#define CHS5                          186
#define ADCON1                        187
#define ADPREF0                       188
#define ADPREF                        189
#define ADPREF1                       190
#define ADNREF                        191
#define ADCS0                         192
#define ADCS                          193
#define ADCS1                         194
#define ADCS2                         195
#define ADFM                          196
#define ADACT                         197
#define ADACT0                        198
#define ADACT1                        199
#define ADACT2                        200
#define ADACT3                        201
#define LATA                          202
#define LATA0                         203
#define LATA1                         204
#define LATA2                         205
#define LATA4                         206
#define LATA5                         207
#define CM1CON0                       208
#define C1SYNC                        209
#define C1HYS                         210
#define C1SP                          211
#define C1POL                         212
#define C1OUT                         213
#define C1ON                          214
#define CM1CON1                       215
#define C1NCH0                        216
#define C1NCH                         217
#define C1NCH1                        218
#define C1NCH2                        219
#define C1PCH                         220
#define C1PCH0                        221
#define C1PCH1                        222
#define C1PCH2                        223
#define C1INTN                        224
#define C1INTP                        225
#define CMOUT                         226
#define MC1OUT                        227
#define BORCON                        228
#define BORRDY                        229
#define SBOREN                        230
#define FVRCON                        231
#define ADFVR0                        232
#define ADFVR                         233
#define ADFVR1                        234
#define CDAFVR                        235
#define CDAFVR0                       236
#define CDAFVR1                       237
#define TSRNG                         238
#define TSEN                          239
#define FVRRDY                        240
#define FVREN                         241
#define DACCON0                       242
#define DAC1NSS                       243
#define DAC1PSS                       244
#define DAC1PSS0                      245
#define DAC1PSS1                      246
#define DAC1OE                        247
#define DAC1EN                        248
#define DACCON1                       249
#define DAC1R                         250
#define DAC1R0                        251
#define DAC1R1                        252
#define DAC1R2                        253
#define DAC1R3                        254
#define DAC1R4                        255
#define ANSELA                        256
#define ANSA0                         257
#define ANSA1                         258
#define ANSA2                         259
#define ANSA4                         260
#define ANSA5                         261
#define RC1REG                        262
#define TX1REG                        263
#define SP1BRGL                       264
#define SP1BRGH                       265
#define RC1STA                        266
#define RX9D                          267
#define OERR                          268
#define FERR                          269
#define ADDEN                         270
#define CREN                          271
#define SREN                          272
#define RX9                           273
#define SPEN                          274
#define TX1STA                        275
#define TX9D                          276
#define TRMT                          277
#define BRGH                          278
#define SENDB                         279
#define SYNC                          280
#define TXEN                          281
#define TX9                           282
#define CSRC                          283
#define BAUD1CON                      284
#define ABDEN                         285
#define WUE                           286
#define BRG16                         287
#define SCKP                          288
#define RCIDL                         289
#define ABDOVF                        290
#define WPUA                          291
#define WPUA0                         292
#define WPUA1                         293
#define WPUA2                         294
#define WPUA3                         295
#define WPUA4                         296
#define WPUA5                         297
#define SSP1BUF                       298
#define BUF                           299
#define BUF0                          300
#define SSP1BUF0                      301
#define BUF1                          302
#define SSP1BUF1                      303
#define BUF2                          304
#define SSP1BUF2                      305
#define BUF3                          306
#define SSP1BUF3                      307
#define BUF4                          308
#define SSP1BUF4                      309
#define BUF5                          310
#define SSP1BUF5                      311
#define BUF6                          312
#define SSP1BUF6                      313
#define BUF7                          314
#define SSP1BUF7                      315
#define ADD0                          316
#define ADD                           317
#define SSP1ADD0                      318
#define SSP1ADD                       319
#define ADD1                          320
#define SSP1ADD1                      321
#define ADD2                          322
#define SSP1ADD2                      323
#define ADD3                          324
#define SSP1ADD3                      325
#define ADD4                          326
#define SSP1ADD4                      327
#define ADD5                          328
#define SSP1ADD5                      329
#define ADD6                          330
#define SSP1ADD6                      331
#define ADD7                          332
#define SSP1ADD7                      333
#define SSP1MSK0                      334
#define SSP1MSK                       335
#define MSK0                          336
#define MSK                           337
#define SSP1MSK1                      338
#define MSK1                          339
#define SSP1MSK2                      340
#define MSK2                          341
#define SSP1MSK3                      342
#define MSK3                          343
#define SSP1MSK4                      344
#define MSK4                          345
#define SSP1MSK5                      346
#define MSK5                          347
#define SSP1MSK6                      348
#define MSK6                          349
#define SSP1MSK7                      350
#define MSK7                          351
#define SSP1STAT                      352
#define BF                            353
#define UA                            354
#define R_nW                          355
#define S                             356
#define P                             357
#define D_nA                          358
#define CKE                           359
#define SMP                           360
#define SSP1CON1                      361
#define SSPM0                         362
#define SSPM                          363
#define SSPM1                         364
#define SSPM2                         365
#define SSPM3                         366
#define CKP                           367
#define SSPEN                         368
#define SSPOV                         369
#define WCOL                          370
#define SSP1CON2                      371
#define SEN                           372
#define RSEN                          373
#define PEN                           374
#define RCEN                          375
#define ACKEN                         376
#define ACKDT                         377
#define ACKSTAT                       378
#define GCEN                          379
#define SSP1CON3                      380
#define DHEN                          381
#define AHEN                          382
#define SBCDE                         383
#define SDAHT                         384
#define BOEN                          385
#define SCIE                          386
#define PCIE                          387
#define ACKTIM                        388
#define ODCONA                        389
#define ODCA0                         390
#define ODCA1                         391
#define ODCA2                         392
#define ODCA4                         393
#define ODCA5                         394
#define CCPR1L                        395
#define CCPR1H                        396
#define CCP1CON                       397
#define CCP1MODE                      398
#define CCP1MODE0                     399
#define CCP1MODE1                     400
#define CCP1MODE2                     401
#define CCP1MODE3                     402
#define CCP1FMT                       403
#define CCP1OUT                       404
#define CCP1EN                        405
#define CCP1CAP                       406
#define CCP1CTS                       407
#define CCP1CTS0                      408
#define CCP1CTS1                      409
#define CCP1CTS2                      410
#define CCPR2L                        411
#define CCPR2H                        412
#define CCP2CON                       413
#define CCP2MODE                      414
#define CCP2MODE0                     415
#define CCP2MODE1                     416
#define CCP2MODE2                     417
#define CCP2MODE3                     418
#define CCP2FMT                       419
#define CCP2OUT                       420
#define CCP2EN                        421
#define CCP2CAP                       422
#define CCP2CTS                       423
#define CCP2CTS0                      424
#define CCP2CTS1                      425
#define CCP2CTS2                      426
#define CCPTMRS                       427
#define C1TSEL                        428
#define C2TSEL                        429
#define SLRCONA                       430
#define SLRA0                         431
#define SLRA1                         432
#define SLRA2                         433
#define SLRA4                         434
#define SLRA5                         435
#define INLVLA                        436
#define INLVLA0                       437
#define INLVLA1                       438
#define INLVLA2                       439
#define INLVLA3                       440
#define INLVLA4                       441
#define INLVLA5                       442
#define IOCAP                         443
#define IOCAP0                        444
#define IOCAP1                        445
#define IOCAP2                        446
#define IOCAP3                        447
#define IOCAP4                        448
#define IOCAP5                        449
#define IOCAN                         450
#define IOCAN0                        451
#define IOCAN1                        452
#define IOCAN2                        453
#define IOCAN3                        454
#define IOCAN4                        455
#define IOCAN5                        456
#define IOCAF                         457
#define IOCAF0                        458
#define IOCAF1                        459
#define IOCAF2                        460
#define IOCAF3                        461
#define IOCAF4                        462
#define IOCAF5                        463
#define CLKRCON                       464
#define CLKRDIV                       465
#define CLKRDIV0                      466
#define CLKRDIV1                      467
#define CLKRDIV2                      468
#define CLKRDC                        469
#define CLKRDC0                       470
#define CLKRDC1                       471
#define CLKREN                        472
#define MDCON                         473
#define MDBIT                         474
#define MDOUT                         475
#define MDOPOL                        476
#define MDEN                          477
#define MDSRC                         478
#define MDMS0                         479
#define MDMS                          480
#define MDMS1                         481
#define MDMS2                         482
#define MDMS3                         483
#define MDCARH                        484
#define MDCH                          485
#define MDCH0                         486
#define MDCH1                         487
#define MDCH2                         488
#define MDCH3                         489
#define MDCHSYNC                      490
#define MDCHPOL                       491
#define MDCARL                        492
#define MDCL0                         493
#define MDCL                          494
#define MDCL1                         495
#define MDCL2                         496
#define MDCL3                         497
#define MDCLSYNC                      498
#define MDCLPOL                       499
#define CCDNA                         500
#define CCDNA0                        501
#define CCDNA1                        502
#define CCDNA2                        503
#define CCDNA4                        504
#define CCDNA5                        505
#define CCDCON                        506
#define CCDS                          507
#define CCDS0                         508
#define CCDS1                         509
#define CCDEN                         510
#define CCDPA                         511
#define CCDPA0                        512
#define CCDPA1                        513
#define CCDPA2                        514
#define CCDPA4                        515
#define CCDPA5                        516
#define NCO1ACCL                      517
#define NCO1ACCL_NCO1ACC              518
#define NCO1ACCH                      519
#define NCO1ACCH_NCO1ACC              520
#define NCO1ACCU                      521
