tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf18313_tdd.h
#define NCO1ACCU_NCO1ACC              522
#define NCO1INCL                      523
#define NCO1INCL_NCO1INC              524
#define NCO1INCH                      525
#define NCO1INCH_NCO1INC              526
#define NCO1INCU                      527
#define NCO1INCU_NCO1INC              528
#define NCO1CON                       529
#define N1PFM                         530
#define N1POL                         531
#define N1OUT                         532
#define N1EN                          533
#define NCO1CLK                       534
#define N1CKS                         535
#define N1PWS                         536
#define PWM5DCL                       537
#define PWM5DCL0                      538
#define PWM5DCL1                      539
#define PWM5DCH                       540
#define PWM5DCH0                      541
#define PWM5DCH1                      542
#define PWM5DCH2                      543
#define PWM5DCH3                      544
#define PWM5DCH4                      545
#define PWM5DCH5                      546
#define PWM5DCH6                      547
#define PWM5DCH7                      548
#define PWM5CON                       549
#define PWM5POL                       550
#define PWM5OUT                       551
#define PWM5EN                        552
#define PWM6DCL                       553
#define PWM6DCL0                      554
#define PWM6DCL1                      555
#define PWM6DCH                       556
#define PWM6DCH0                      557
#define PWM6DCH1                      558
#define PWM6DCH2                      559
#define PWM6DCH3                      560
#define PWM6DCH4                      561
#define PWM6DCH5                      562
#define PWM6DCH6                      563
#define PWM6DCH7                      564
#define PWM6CON                       565
#define PWM6POL                       566
#define PWM6OUT                       567
#define PWM6EN                        568
#define CWG1CLKCON                    569
#define CS                            570
#define CWG1CS                        571
#define CWG1DAT                       572
#define DAT                           573
#define CWG1DAT0                      574
#define CWG1DAT1                      575
#define CWG1DAT2                      576
#define CWG1DAT3                      577
#define CWG1DBR0                      578
#define CWG1DBR                       579
#define DBR                           580
#define DBR0                          581
#define CWG1DBR1                      582
#define DBR1                          583
#define CWG1DBR2                      584
#define DBR2                          585
#define CWG1DBR3                      586
#define DBR3                          587
#define CWG1DBR4                      588
#define DBR4                          589
#define CWG1DBR5                      590
#define DBR5                          591
#define CWG1DBF                       592
#define CWG1DBF0                      593
#define DBF                           594
#define DBF0                          595
#define CWG1DBF1                      596
#define DBF1                          597
#define CWG1DBF2                      598
#define DBF2                          599
#define CWG1DBF3                      600
#define DBF3                          601
#define CWG1DBF4                      602
#define DBF4                          603
#define DBF5                          604
#define CWG1DBF5                      605
#define CWG1CON0                      606
#define CWG1MODE0                     607
#define CWG1CON0_MODE                 608
#define CWG1CON0_MODE0                609
#define CWG1MODE                      610
#define CWG1MODE1                     611
#define CWG1CON0_MODE1                612
#define CWG1MODE2                     613
#define CWG1CON0_MODE2                614
#define LD                            615
#define CWG1LD                        616
#define CWG1EN                        617
#define G1EN                          618
#define CWG1CON0_EN                   619
#define CWG1CON1                      620
#define CWG1POLA                      621
#define POLA                          622
#define CWG1POLB                      623
#define POLB                          624
#define CWG1POLC                      625
#define POLC                          626
#define CWG1POLD                      627
#define POLD                          628
#define IN                            629
#define CWG1IN                        630
#define CWG1AS0                       631
#define CWG1LSAC                      632
#define LSAC                          633
#define LSAC0                         634
#define CWG1LSAC0                     635
#define LSAC1                         636
#define CWG1LSAC1                     637
#define LSBD0                         638
#define CWG1LSBD0                     639
#define LSBD                          640
#define CWG1LSBD                      641
#define LSBD1                         642
#define CWG1LSBD1                     643
#define CWG1REN                       644
#define REN                           645
#define CWG1SHUTDOWN                  646
#define SHUTDOWN                      647
#define CWG1AS1                       648
#define AS0E                          649
#define AS1E                          650
#define AS3E                          651
#define CWG1STR                       652
#define CWG1STRA                      653
#define STRA                          654
#define STRB                          655
#define CWG1STRB                      656
#define CWG1STRC                      657
#define STRC                          658
#define CWG1STRD                      659
#define STRD                          660
#define OVRA                          661
#define CWG1OVRA                      662
#define CWG1OVRB                      663
#define OVRB                          664
#define OVRC                          665
#define CWG1OVRC                      666
#define OVRD                          667
#define CWG1OVRD                      668
#define NVMADR0                       669
#define NVMADRL                       670
#define NVMADR1                       671
#define NVMADR2                       672
#define NVMADR3                       673
#define NVMADR4                       674
#define NVMADR5                       675
#define NVMADR6                       676
#define NVMADR7                       677
#define NVMADR8                       678
#define NVMADRH                       679
#define NVMADR9                       680
#define NVMADR10                      681
#define NVMADR11                      682
#define NVMADR12                      683
#define NVMADR13                      684
#define NVMADR14                      685
#define NVMDAT0                       686
#define NVMDATL                       687
#define NVMDAT1                       688
#define NVMDAT2                       689
#define NVMDAT3                       690
#define NVMDAT4                       691
#define NVMDAT5                       692
#define NVMDAT6                       693
#define NVMDAT7                       694
#define NVMDAT8                       695
#define NVMDATH                       696
#define NVMDAT9                       697
#define NVMDAT10                      698
#define NVMDAT11                      699
#define NVMDAT12                      700
#define NVMDAT13                      701
#define NVMCON1                       702
#define RD                            703
#define WR                            704
#define WREN                          705
#define WRERR                         706
#define FREE                          707
#define LWLO                          708
#define NVMREGS                       709
#define NVMCON2                       710
#define NMVCON2                       711
#define PCON0                         712
#define nBOR                          713
#define nPOR                          714
#define nRI                           715
#define nRMCLR                        716
#define nRWDT                         717
#define STKUNF                        718
#define STKOVF                        719
#define PMD0                          720
#define IOCMD                         721
#define CLKRMD                        722
#define NVMMD                         723
#define FVRMD                         724
#define SYSCMD                        725
#define PMD1                          726
#define TMR0MD                        727
#define TMR1MD                        728
#define TMR2MD                        729
#define NCOMD                         730
#define PMD2                          731
#define CMP1MD                        732
#define ADCMD                         733
#define DACMD                         734
#define PMD3                          735
#define CCP1MD                        736
#define CCP2MD                        737
#define PWM5MD                        738
#define PWM6MD                        739
#define CWG1MD                        740
#define PMD4                          741
#define MSSP1MD                       742
#define UART1MD                       743
#define PMD5                          744
#define DSMMD                         745
#define CLC1MD                        746
#define CLC2MD                        747
#define CPUDOZE                       748
#define DOZE0                         749
#define DOZE                          750
#define DOZE1                         751
#define DOZE2                         752
#define DOE                           753
#define ROI                           754
#define DOZEN                         755
#define IDLEN                         756
#define OSCCON1                       757
#define NDIV0                         758
#define NDIV                          759
#define NDIV1                         760
#define NDIV2                         761
#define NDIV3                         762
#define NOSC0                         763
#define NOSC                          764
#define NOSC1                         765
#define NOSC2                         766
#define OSCCON2                       767
#define CDIV0                         768
#define CDIV                          769
#define CDIV1                         770
#define CDIV2                         771
#define CDIV3                         772
#define COSC                          773
#define COSC0                         774
#define COSC1                         775
#define COSC2                         776
#define OSCCON3                       777
#define NOSCR                         778
#define ORDY                          779
#define SOSCBE                        780
#define SOSCPWR                       781
#define CSWHOLD                       782
#define OSCSTAT1                      783
#define PLLR                          784
#define ADOR                          785
#define SOR                           786
#define LFOR                          787
#define HFOR                          788
#define EXTOR                         789
#define OSCEN                         790
#define ADOEN                         791
#define SOSCEN                        792
#define LFOEN                         793
#define HFOEN                         794
#define EXTOEN                        795
#define OSCTUNE                       796
#define HFTUN0                        797
#define HFTUN                         798
#define HFTUN1                        799
#define HFTUN2                        800
#define HFTUN3                        801
#define HFTUN4                        802
#define HFTUN5                        803
#define OSCFRQ                        804
#define HFFRQ                         805
#define HFFRQ0                        806
#define HFFRQ1                        807
#define HFFRQ2                        808
#define HFFRQ3                        809
#define PPSLOCK                       810
#define PPSLOCKED                     811
#define INTPPS0                       812
#define INTPPS                        813
#define INTPPS1                       814
#define INTPPS2                       815
#define INTPPS3                       816
#define INTPPS4                       817
#define T0CKIPPS0                     818
#define T0CKIPPS                      819
#define T0CKIPPS1                     820
#define T0CKIPPS2                     821
#define T0CKIPPS3                     822
#define T0CKIPPS4                     823
#define T1CKIPPS0                     824
#define T1CKIPPS                      825
#define T1CKIPPS1                     826
#define T1CKIPPS2                     827
#define T1CKIPPS3                     828
#define T1CKIPPS4                     829
#define T1GPPS0                       830
#define T1GPPS                        831
#define T1GPPS1                       832
#define T1GPPS2                       833
#define T1GPPS3                       834
#define T1GPPS4                       835
#define CCP1PPS0                      836
#define CCP1PPS                       837
#define CCP1PPS1                      838
#define CCP1PPS2                      839
#define CCP1PPS3                      840
#define CCP1PPS4                      841
#define CCP2PPS0                      842
#define CCP2PPS                       843
#define CCP2PPS1                      844
#define CCP2PPS2                      845
#define CCP2PPS3                      846
#define CCP2PPS4                      847
#define CWG1PPS0                      848
#define CWG1PPS                       849
#define CWG1PPS1                      850
#define CWG1PPS2                      851
#define CWG1PPS3                      852
#define CWG1PPS4                      853
#define MDCIN1PPS                     854
#define MDCIN1PPS0                    855
#define MDCIN1PPS1                    856
#define MDCIN1PPS2                    857
#define MDCIN1PPS3                    858
#define MDCIN1PPS4                    859
#define MDCIN2PPS0                    860
#define MDCIN2PPS                     861
#define MDCIN2PPS1                    862
#define MDCIN2PPS2                    863
#define MDCIN2PPS3                    864
#define MDCIN2PPS4                    865
#define MDMINPPS                      866
#define MDMINPPS0                     867
#define MDMINPPS1                     868
#define MDMINPPS2                     869
#define MDMINPPS3                     870
#define MDMINPPS4                     871
#define SSP1CLKPPS0                   872
#define SSP1CLKPPS                    873
#define SSP1CLKPPS1                   874
#define SSP1CLKPPS2                   875
#define SSP1CLKPPS3                   876
#define SSP1CLKPPS4                   877
#define SSP1DATPPS0                   878
#define SSP1DATPPS                    879
#define SSP1DATPPS1                   880
#define SSP1DATPPS2                   881
#define SSP1DATPPS3                   882
#define SSP1DATPPS4                   883
#define SSP1SSPPS                     884
#define SSP1SSPPS0                    885
#define SSP1SSPPS1                    886
#define SSP1SSPPS2                    887
#define SSP1SSPPS3                    888
#define SSP1SSPPS4                    889
#define RXPPS0                        890
#define RXPPS                         891
#define RXPPS1                        892
#define RXPPS2                        893
#define RXPPS3                        894
#define RXPPS4                        895
#define TXPPS0                        896
#define TXPPS                         897
#define TXPPS1                        898
#define TXPPS2                        899
#define TXPPS3                        900
#define TXPPS4                        901
#define CLCIN0PPS                     902
#define CLCIN0PPS0                    903
#define CLCIN0PPS1                    904
#define CLCIN0PPS2                    905
#define CLCIN0PPS3                    906
#define CLCIN0PPS4                    907
#define CLCIN1PPS0                    908
#define CLCIN1PPS                     909
#define CLCIN1PPS1                    910
#define CLCIN1PPS2                    911
#define CLCIN1PPS3                    912
#define CLCIN1PPS4                    913
#define CLCIN2PPS                     914
#define CLCIN2PPS0                    915
#define CLCIN2PPS1                    916
#define CLCIN2PPS2                    917
#define CLCIN2PPS3                    918
#define CLCIN2PPS4                    919
#define CLCIN3PPS                     920
#define CLCIN3PPS0                    921
#define CLCIN3PPS1                    922
#define CLCIN3PPS2                    923
#define CLCIN3PPS3                    924
#define CLCIN3PPS4                    925
#define RA0PPS                        926
#define RA0PPS0                       927
#define RA0PPS1                       928
#define RA0PPS2                       929
#define RA0PPS3                       930
#define RA0PPS4                       931
#define RA1PPS                        932
#define RA1PPS0                       933
#define RA1PPS1                       934
#define RA1PPS2                       935
#define RA1PPS3                       936
#define RA1PPS4                       937
#define RA2PPS0                       938
#define RA2PPS                        939
#define RA2PPS1                       940
#define RA2PPS2                       941
#define RA2PPS3                       942
#define RA2PPS4                       943
#define RA4PPS                        944
#define RA4PPS0                       945
#define RA4PPS1                       946
#define RA4PPS2                       947
#define RA4PPS3                       948
#define RA4PPS4                       949
#define RA5PPS                        950
#define RA5PPS0                       951
#define RA5PPS1                       952
#define RA5PPS2                       953
#define RA5PPS3                       954
#define RA5PPS4                       955
#define CLCDATA                       956
#define MLC1OUT                       957
#define MLC2OUT                       958
#define CLC1CON                       959
#define CLC1CON_MODE0                 960
#define LC1MODE                       961
#define CLC1CON_MODE                  962
#define LC1MODE0                      963
#define CLC1CON_MODE1                 964
#define LC1MODE1                      965
#define LC1MODE2                      966
#define CLC1CON_MODE2                 967
#define LC1INTN                       968
#define CLC1CON_INTN                  969
#define CLC1CON_INTP                  970
#define LC1INTP                       971
#define LC1OUT                        972
#define CLC1CON_OUT                   973
#define CLC1CON_EN                    974
#define LC1EN                         975
#define CLC1POL                       976
#define LC1G1POL                      977
#define CLC1POL_G1POL                 978
#define CLC1POL_G2POL                 979
#define LC1G2POL                      980
#define LC1G3POL                      981
#define CLC1POL_G3POL                 982
#define LC1G4POL                      983
#define CLC1POL_G4POL                 984
#define CLC1POL_POL                   985
#define LC1POL                        986
#define CLC1SEL0                      987
#define CLC1SEL0_D1S0                 988
#define LC1D1S                        989
#define LC1D1S0                       990
#define CLC1SEL0_D1S                  991
#define CLC1SEL0_D1S1                 992
#define LC1D1S1                       993
#define CLC1SEL0_D1S2                 994
#define LC1D1S2                       995
#define CLC1SEL0_D1S3                 996
#define LC1D1S3                       997
#define CLC1SEL0_D1S4                 998
#define LC1D1S4                       999
#define CLC1SEL1                      1000
#define CLC1SEL1_D2S0                 1001
#define CLC1SEL1_D2S                  1002
#define LC1D2S                        1003
#define LC1D2S0                       1004
#define CLC1SEL1_D2S1                 1005
#define LC1D2S1                       1006
#define LC1D2S2                       1007
#define CLC1SEL1_D2S2                 1008
#define LC1D2S3                       1009
#define CLC1SEL1_D2S3                 1010
#define LC1D2S4                       1011
#define CLC1SEL1_D2S4                 1012
#define CLC1SEL2                      1013
#define LC1D3S0                       1014
#define CLC1SEL2_D3S                  1015
#define LC1D3S                        1016
#define CLC1SEL2_D3S0                 1017
#define LC1D3S1                       1018
#define CLC1SEL2_D3S1                 1019
#define LC1D3S2                       1020
#define CLC1SEL2_D3S2                 1021
#define LC1D3S3                       1022
#define CLC1SEL2_D3S3                 1023
#define LC1D3S4                       1024
#define CLC1SEL2_D3S4                 1025
#define CLC1SEL3                      1026
#define CLC1SEL3_D4S                  1027
#define LC1D4S                        1028
#define LC1D4S0                       1029
#define CLC1SEL3_D4S0                 1030
#define CLC1SEL3_D4S1                 1031
#define LC1D4S1                       1032
#define LC1D4S2                       1033
#define CLC1SEL3_D4S2                 1034
#define LC1D4S3                       1035
#define CLC1SEL3_D4S3                 1036
#define LC1D4S4                       1037
#define CLC1SEL3_D4S4                 1038
#define CLC1GLS0                      1039
#define CLC1GLS0_D1N                  1040
#define LC1G1D1N                      1041
#define CLC1GLS0_D1T                  1042
#define LC1G1D1T                      1043
#define LC1G1D2N                      1044
#define CLC1GLS0_D2N                  1045
#define LC1G1D2T                      1046
#define CLC1GLS0_D2T                  1047
#define CLC1GLS0_D3N                  1048
#define LC1G1D3N                      1049
#define CLC1GLS0_D3T                  1050
#define LC1G1D3T                      1051
#define CLC1GLS0_D4N                  1052
#define LC1G1D4N                      1053
#define CLC1GLS0_D4T                  1054
#define LC1G1D4T                      1055
#define CLC1GLS1                      1056
#define CLC1GLS1_D1N                  1057
#define LC1G2D1N                      1058
#define LC1G2D1T                      1059
#define CLC1GLS1_D1T                  1060
#define CLC1GLS1_D2N                  1061
#define LC1G2D2N                      1062
#define LC1G2D2T                      1063
#define CLC1GLS1_D2T                  1064
#define CLC1GLS1_D3N                  1065
#define LC1G2D3N                      1066
#define LC1G2D3T                      1067
#define CLC1GLS1_D3T                  1068
#define CLC1GLS1_D4N                  1069
#define LC1G2D4N                      1070
#define LC1G2D4T                      1071
#define CLC1GLS1_D4T                  1072
#define CLC1GLS2                      1073
#define CLC1GLS2_D1N                  1074
#define LC1G3D1N                      1075
#define LC1G3D1T                      1076
#define CLC1GLS2_D1T                  1077
#define LC1G3D2N                      1078
#define CLC1GLS2_D2N                  1079
#define LC1G3D2T                      1080
#define CLC1GLS2_D2T                  1081
#define CLC1GLS2_D3N                  1082
#define LC1G3D3N                      1083
#define LC1G3D3T                      1084
#define CLC1GLS2_D3T                  1085
#define LC1G3D4N                      1086
#define CLC1GLS2_D4N                  1087
#define LC1G3D4T                      1088
#define CLC1GLS2_D4T                  1089
#define CLC1GLS3                      1090
