tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf18313_tdd.h
#define LC1G4D1N                      1091
#define CLC1GLS3_G4D1N                1092
#define LC1G4D1T                      1093
#define CLC1GLS3_G4D1T                1094
#define CLC1GLS3_G4D2N                1095
#define LC1G4D2N                      1096
#define CLC1GLS3_G4D2T                1097
#define LC1G4D2T                      1098
#define LC1G4D3N                      1099
#define CLC1GLS3_G4D3N                1100
#define LC1G4D3T                      1101
#define CLC1GLS3_G4D3T                1102
#define CLC1GLS3_G4D4N                1103
#define LC1G4D4N                      1104
#define CLC1GLS3_G4D4T                1105
#define LC1G4D4T                      1106
#define CLC2CON                       1107
#define LC2MODE0                      1108
#define CLC2CON_MODE                  1109
#define LC2MODE                       1110
#define CLC2CON_MODE0                 1111
#define LC2MODE1                      1112
#define CLC2CON_MODE1                 1113
#define LC2MODE2                      1114
#define CLC2CON_MODE2                 1115
#define LC2INTN                       1116
#define CLC2CON_INTN                  1117
#define LC2INTP                       1118
#define CLC2CON_INTP                  1119
#define CLC2CON_OUT                   1120
#define LC2OUT                        1121
#define CLC2CON_EN                    1122
#define LC2EN                         1123
#define CLC2POL                       1124
#define LC2G1POL                      1125
#define CLC2POL_G1POL                 1126
#define LC2G2POL                      1127
#define CLC2POL_G2POL                 1128
#define LC2G3POL                      1129
#define CLC2POL_G3POL                 1130
#define LC2G4POL                      1131
#define CLC2POL_G4POL                 1132
#define CLC2POL_POL                   1133
#define LC2POL                        1134
#define CLC2SEL0                      1135
#define CLC2SEL0_D1S                  1136
#define LC2D1S0                       1137
#define CLC2SEL0_D1S0                 1138
#define LC2D1S                        1139
#define LC2D1S1                       1140
#define CLC2SEL0_D1S1                 1141
#define LC2D1S2                       1142
#define CLC2SEL0_D1S2                 1143
#define CLC2SEL0_D1S3                 1144
#define LC2D1S3                       1145
#define LC2D1S4                       1146
#define CLC2SEL0_D1S4                 1147
#define CLC2SEL1                      1148
#define LC2D2S0                       1149
#define CLC2SEL1_D2S0                 1150
#define LC2D2S                        1151
#define CLC2SEL1_D2S                  1152
#define LC2D2S1                       1153
#define CLC2SEL1_D2S1                 1154
#define LC2D2S2                       1155
#define CLC2SEL1_D2S2                 1156
#define LC2D2S3                       1157
#define CLC2SEL1_D2S3                 1158
#define LC2D2S4                       1159
#define CLC2SEL1_D2S4                 1160
#define CLC2SEL2                      1161
#define CLC2SEL2_D3S                  1162
#define LC2D3S0                       1163
#define CLC2SEL2_D3S0                 1164
#define LC2D3S                        1165
#define CLC2SEL2_D3S1                 1166
#define LC2D3S1                       1167
#define LC2D3S2                       1168
#define CLC2SEL2_D3S2                 1169
#define LC2D3S3                       1170
#define CLC2SEL2_D3S3                 1171
#define LC2D3S4                       1172
#define CLC2SEL2_D3S4                 1173
#define CLC2SEL3                      1174
#define LC2D4S                        1175
#define LC2D4S0                       1176
#define CLC2SEL3_D4S                  1177
#define CLC2SEL3_D4S0                 1178
#define LC2D4S1                       1179
#define CLC2SEL3_D4S1                 1180
#define LC2D4S2                       1181
#define CLC2SEL3_D4S2                 1182
#define CLC2SEL3_D4S3                 1183
#define LC2D4S3                       1184
#define LC2D4S4                       1185
#define CLC2SEL3_D4S4                 1186
#define CLC2GLS0                      1187
#define LC2G1D1N                      1188
#define CLC2GLS0_D1N                  1189
#define CLC2GLS0_D1T                  1190
#define LC2G1D1T                      1191
#define LC2G1D2N                      1192
#define CLC2GLS0_D2N                  1193
#define CLC2GLS0_D2T                  1194
#define LC2G1D2T                      1195
#define LC2G1D3N                      1196
#define CLC2GLS0_D3N                  1197
#define CLC2GLS0_D3T                  1198
#define LC2G1D3T                      1199
#define LC2G1D4N                      1200
#define CLC2GLS0_D4N                  1201
#define CLC2GLS0_D4T                  1202
#define LC2G1D4T                      1203
#define CLC2GLS1                      1204
#define CLC2GLS1_D1N                  1205
#define LC2G2D1N                      1206
#define CLC2GLS1_D1T                  1207
#define LC2G2D1T                      1208
#define CLC2GLS1_D2N                  1209
#define LC2G2D2N                      1210
#define CLC2GLS1_D2T                  1211
#define LC2G2D2T                      1212
#define LC2G2D3N                      1213
#define CLC2GLS1_D3N                  1214
#define LC2G2D3T                      1215
#define CLC2GLS1_D3T                  1216
#define LC2G2D4N                      1217
#define CLC2GLS1_D4N                  1218
#define LC2G2D4T                      1219
#define CLC2GLS1_D4T                  1220
#define CLC2GLS2                      1221
#define LC2G3D1N                      1222
#define CLC2GLS2_D1N                  1223
#define CLC2GLS2_D1T                  1224
#define LC2G3D1T                      1225
#define CLC2GLS2_D2N                  1226
#define LC2G3D2N                      1227
#define LC2G3D2T                      1228
#define CLC2GLS2_D2T                  1229
#define CLC2GLS2_D3N                  1230
#define LC2G3D3N                      1231
#define CLC2GLS2_D3T                  1232
#define LC2G3D3T                      1233
#define CLC2GLS2_D4N                  1234
#define LC2G3D4N                      1235
#define LC2G3D4T                      1236
#define CLC2GLS2_D4T                  1237
#define CLC2GLS3                      1238
#define LC2G4D1N                      1239
#define CLC2GLS3_G4D1N                1240
#define CLC2GLS3_G4D1T                1241
#define LC2G4D1T                      1242
#define CLC2GLS3_G4D2N                1243
#define LC2G4D2N                      1244
#define LC2G4D2T                      1245
#define CLC2GLS3_G4D2T                1246
#define CLC2GLS3_G4D3N                1247
#define LC2G4D3N                      1248
#define CLC2GLS3_G4D3T                1249
#define LC2G4D3T                      1250
#define LC2G4D4N                      1251
#define CLC2GLS3_G4D4N                1252
#define CLC2GLS3_G4D4T                1253
#define LC2G4D4T                      1254
#define STATUS_SHAD                   1255
#define C_SHAD                        1256
#define DC_SHAD                       1257
#define Z_SHAD                        1258
#define WREG_SHAD                     1259
#define BSR_SHAD                      1260
#define PCLATH_SHAD                   1261
#define FSR0L_SHAD                    1262
#define FSR0H_SHAD                    1263
#define FSR1L_SHAD                    1264
#define FSR1H_SHAD                    1265
#define STKPTR                        1266
#define TOSL                          1267
#define TOSH                          1268

#endif // _PIC16LF18313_H_
